<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"1f3584b386e71f8b33cf1cbba2e4878a93889422c100e40c73aa33fb18b24b7b","plan_job_ref":"Job Plan Airflow DAGs #198 at https://github.com/cal-itp/data-infra/actions/runs/16155312845","plan_out_hash":"0de799333a56031b00fd5df13e4386cf5c1d57689c3977d9d6aab10b6e9cc135","plan_hash":"f3ca1cd11c7252a2883e50bdbda9606e50a98e5a3205e58c4a86ceacd2aeddfb","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 19 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/copy_prod_archiver_configs_to_test/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "eIV0nQ==" -> (known after apply)
!~      detect_md5hash      = "hZ6CJUPJNg/N7Kp++Y8Vlw==" -> "different hash"
!~      generation          = 1751416673356965 -> (known after apply)
        id                  = "calitp-composer-dags/copy_prod_archiver_configs_to_test/METADATA.yml"
!~      md5hash             = "hZ6CJUPJNg/N7Kp++Y8Vlw==" -> (known after apply)
        name                = "dags/copy_prod_archiver_configs_to_test/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/create_external_tables/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "zPpjUg==" -> (known after apply)
!~      detect_md5hash      = "Jx2PO7zPxK8EgOVeTF2Uow==" -> "different hash"
!~      generation          = 1751416672924625 -> (known after apply)
        id                  = "calitp-composer-dags/create_external_tables/METADATA.yml"
!~      md5hash             = "Jx2PO7zPxK8EgOVeTF2Uow==" -> (known after apply)
        name                = "dags/create_external_tables/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/download_gtfs_schedule_v2/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "UJlKjw==" -> (known after apply)
!~      detect_md5hash      = "ZyukjAhtleSBUBGD7mxNHw==" -> "different hash"
!~      generation          = 1751416671591066 -> (known after apply)
        id                  = "calitp-composer-dags/download_gtfs_schedule_v2/METADATA.yml"
!~      md5hash             = "ZyukjAhtleSBUBGD7mxNHw==" -> (known after apply)
        name                = "dags/download_gtfs_schedule_v2/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/ntd_report_from_blackcat/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "bk76gA==" -> (known after apply)
!~      detect_md5hash      = "U+uVWKl494jWU1hH5XsUJA==" -> "different hash"
!~      generation          = 1752009255107043 -> (known after apply)
        id                  = "calitp-composer-dags/ntd_report_from_blackcat/METADATA.yml"
!~      md5hash             = "U+uVWKl494jWU1hH5XsUJA==" -> (known after apply)
        name                = "dags/ntd_report_from_blackcat/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/parse_and_validate_rt_v2/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "HyBHVA==" -> (known after apply)
!~      detect_md5hash      = "wrmKUcXaIfEKR9bSVx16Yw==" -> "different hash"
!~      generation          = 1751416675236493 -> (known after apply)
        id                  = "calitp-composer-dags/parse_and_validate_rt_v2/METADATA.yml"
!~      md5hash             = "wrmKUcXaIfEKR9bSVx16Yw==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/parse_elavon/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "EOqS+A==" -> (known after apply)
!~      detect_md5hash      = "/5+MT59eEvNG/f9aQd+64Q==" -> "different hash"
!~      generation          = 1751416670349146 -> (known after apply)
        id                  = "calitp-composer-dags/parse_elavon/METADATA.yml"
!~      md5hash             = "/5+MT59eEvNG/f9aQd+64Q==" -> (known after apply)
        name                = "dags/parse_elavon/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/parse_littlepay/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "v/f27w==" -> (known after apply)
!~      detect_md5hash      = "Ds9cv9jKTd8JmDv9cAXOJg==" -> "different hash"
!~      generation          = 1751416672962103 -> (known after apply)
        id                  = "calitp-composer-dags/parse_littlepay/METADATA.yml"
!~      md5hash             = "Ds9cv9jKTd8JmDv9cAXOJg==" -> (known after apply)
        name                = "dags/parse_littlepay/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/parse_littlepay_v3/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "HNLWCA==" -> (known after apply)
!~      detect_md5hash      = "43Vg9BmjyN10W5m/leb7CQ==" -> "different hash"
!~      generation          = 1751416671542953 -> (known after apply)
        id                  = "calitp-composer-dags/parse_littlepay_v3/METADATA.yml"
!~      md5hash             = "43Vg9BmjyN10W5m/leb7CQ==" -> (known after apply)
        name                = "dags/parse_littlepay_v3/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/publish_open_data/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "brecPw==" -> (known after apply)
!~      detect_md5hash      = "wE+rqpzARckUcut/8KHy3w==" -> "different hash"
!~      generation          = 1751416671866708 -> (known after apply)
        id                  = "calitp-composer-dags/publish_open_data/METADATA.yml"
!~      md5hash             = "wE+rqpzARckUcut/8KHy3w==" -> (known after apply)
        name                = "dags/publish_open_data/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/scrape_feed_aggregators/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "SA6ZeA==" -> (known after apply)
!~      detect_md5hash      = "nNh2row6newV6909+3BRNg==" -> "different hash"
!~      generation          = 1751416670532348 -> (known after apply)
        id                  = "calitp-composer-dags/scrape_feed_aggregators/METADATA.yml"
!~      md5hash             = "nNh2row6newV6909+3BRNg==" -> (known after apply)
        name                = "dags/scrape_feed_aggregators/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/scrape_state_geoportal/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "7YqYZA==" -> (known after apply)
!~      detect_md5hash      = "rD1W4P5nudN5u53Ayc/itQ==" -> "different hash"
!~      generation          = 1751416672003175 -> (known after apply)
        id                  = "calitp-composer-dags/scrape_state_geoportal/METADATA.yml"
!~      md5hash             = "rD1W4P5nudN5u53Ayc/itQ==" -> (known after apply)
        name                = "dags/scrape_state_geoportal/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_littlepay/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "HPJ8wQ==" -> (known after apply)
!~      detect_md5hash      = "eqfVIlJHwR7/VkrRjTHh3w==" -> "different hash"
!~      generation          = 1751416670459419 -> (known after apply)
        id                  = "calitp-composer-dags/sync_littlepay/METADATA.yml"
!~      md5hash             = "eqfVIlJHwR7/VkrRjTHh3w==" -> (known after apply)
        name                = "dags/sync_littlepay/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_littlepay_v3/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "D2IoIQ==" -> (known after apply)
!~      detect_md5hash      = "+/RlClZ29rRyBkIZC2t/lg==" -> "different hash"
!~      generation          = 1751416674890967 -> (known after apply)
        id                  = "calitp-composer-dags/sync_littlepay_v3/METADATA.yml"
!~      md5hash             = "+/RlClZ29rRyBkIZC2t/lg==" -> (known after apply)
        name                = "dags/sync_littlepay_v3/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_ntd_data_api/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "hn6ypA==" -> (known after apply)
!~      detect_md5hash      = "acExT17wEobTdtJzDP03yg==" -> "different hash"
!~      generation          = 1751997652151383 -> (known after apply)
        id                  = "calitp-composer-dags/sync_ntd_data_api/METADATA.yml"
!~      md5hash             = "acExT17wEobTdtJzDP03yg==" -> (known after apply)
        name                = "dags/sync_ntd_data_api/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_ntd_data_xlsx/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "fXaIgA==" -> (known after apply)
!~      detect_md5hash      = "2dZvDNNjmSjvb5l/P+5uMA==" -> "different hash"
!~      generation          = 1751997661328384 -> (known after apply)
        id                  = "calitp-composer-dags/sync_ntd_data_xlsx/METADATA.yml"
!~      md5hash             = "2dZvDNNjmSjvb5l/P+5uMA==" -> (known after apply)
        name                = "dags/sync_ntd_data_xlsx/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "TZ8PPg==" -> (known after apply)
!~      detect_md5hash      = "wuSPvBDNDmi83FhU1OaU0A==" -> "different hash"
!~      generation          = 1751416670828482 -> (known after apply)
        id                  = "calitp-composer-dags/transform_warehouse/METADATA.yml"
!~      md5hash             = "wuSPvBDNDmi83FhU1OaU0A==" -> (known after apply)
        name                = "dags/transform_warehouse/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse_full_refresh/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "N+xt5Q==" -> (known after apply)
!~      detect_md5hash      = "S9eBae7hUZeNeqlsol8W2g==" -> "different hash"
!~      generation          = 1751416672526361 -> (known after apply)
        id                  = "calitp-composer-dags/transform_warehouse_full_refresh/METADATA.yml"
!~      md5hash             = "S9eBae7hUZeNeqlsol8W2g==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse_full_refresh_sunday/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "mC+VGw==" -> (known after apply)
!~      detect_md5hash      = "3LEF0S2Yv67+kbrz35RO0Q==" -> "different hash"
!~      generation          = 1751416672126526 -> (known after apply)
        id                  = "calitp-composer-dags/transform_warehouse_full_refresh_sunday/METADATA.yml"
!~      md5hash             = "3LEF0S2Yv67+kbrz35RO0Q==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
        id                  = "calitp-composer-data/warehouse/target/partial_parse.msgpack"
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (21 unchanged attributes hidden)
    }

Plan: 0 to add, 19 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #198](https://github.com/cal-itp/data-infra/actions/runs/16155312845)